################### USER TEXT ###########################
START_ADMIN_TEXT = "<b>✅ Бот был успешно запущен</b>"
PROFILE_TEXT = "<b>Ваш профиль</b>\nID: <code>{user_id}</code>\nБаланс: <code>{balance}</code>"
MENU_TEXT = "<b>Добро пожаловать!</b>"

################### ERROR TEXT ###########################
CANCEL_TEXT = "❌ Действие отменено!"
ERROR_TEXT = "<i>❌ Ошибка выполнения действия! Повторите попытку</i>"
COMMAND_NOT_FOUND_TEXT = "<i>❌ Команда не найдена, введите /start для вызова меню</i>"
USER_NOT_FOUND_TEXT = "<i>❌ Пользователь не найден!</i>"
WORK_TEXT = "⛔ Бот находится на тех работах."
ANTIFLOOD_TEXT = "❌ Пожалуйста не спамьте!"

################### ADMIN TEXT ###########################
ADMIN_INFORMATION_TEXT = "Админ панель"
ADMIN_RESTART_CONFIRM_TEXT = "<b>❗️ ВНИМАНИЕ</b>\nПри перезагрузке будут сброшены все активные States, вы уверены что хотите это сделать?"
ADMIN_RESTART_START_TEXT = "<b>❗️ Перезагрузка бота запущена!</b>"
ADMIN_FIND_USER_TEXT = "<b>👤 Введите ник или айди пользователя...</b>"

################### ADMIN KEYBOARD ###########################
ADMIN_MENU_KEYBOARD = "🎩 Админ панель"
ADMIN_FIND_KEYBOARD = "👤 Поиск пользователя"
ADMIN_RESTART_KEYBOARD = "📛 Перезапустить бота"

################### USER KEYBOARD ###########################
PROFILE_KEYBOARD = "👤 Профиль"

################### OTHER ###########################
BACK_BUTTON = "🔙 Вернуться"
START_COMMAND = "📄 Главное меню"